<img src='Data/ERD.png'>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sqlalchemy import create_engine,Table, Column, Integer, String, MetaData, VARCHAR
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()

## Change username and password to match your personal MySQL Server settings
#username = 'root' # default username for MySQL db is root
#password = 'Dino2010' # whatever password you chose during MySQL installation.

In [2]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "Dino2010" # (or whatever password you chose during mysql installation)
db_name = "book"

connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [3]:
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/book)

In [4]:
#create_database(connection)

In [5]:
database_exists(connection)

True

In [6]:
# checking if the database exists. If not, create it. 
if database_exists(connection) == False:
    create_database(connection)
else:
    print('The database already exists')

The database already exists

In [7]:
df = pd.read_csv('Data/data.csv')
df.head()

,First Name,Last Name,Email,Book Title,Book Author
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

In [25]:
df_user = pd.read_csv('Data/user.csv')
df_user.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [10]:
df_user = pd.read_csv('Data/user.csv')
df_user.to_sql('user', con=engine, if_exists='replace', index=False)

3

In [8]:
df_books = pd.read_csv('Data/books.csv')
df_books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [9]:
df_books.to_sql('books', con=engine, if_exists='replace', index=False)

6

In [10]:
df_authors = pd.read_csv('Data/authors.csv')
df_authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [11]:
df_authors.to_sql('authors', con=engine, if_exists='replace', index=False)

5

In [12]:
df_favorites = pd.read_csv('Data/favorites.csv')
df_favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [13]:
df_favorites.to_sql('favorites', con=engine, if_exists='replace', index=False)

7

In [14]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_book
0        authors
1          books
2           data
3      favorites
4           user

In [15]:
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/book)

In [16]:
q = """SELECT * FROM data;"""
pd.read_sql(q, engine)

,index,First Name,Last Name,Email,Book Title,Book Author
0,0,John,Doe,JD@books.com,The Shining,Stephen King
1,1,John,Doe,JD@books.com,It,Stephen King
2,2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen
5,5,Gloria,Rodriguez,grodriguez@books.com,Pride and Prejudice,Jane Austen
6,6,Gloria,Rodriguez,grodriguez@books.com,Frankenstein,Mary Shelley

In [17]:
q = """SELECT * FROM user;"""
pd.read_sql(q, engine)

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com